{
  "person": {
    "firstName": "Joe",
    "lastName": "Playdon",
    "role": "Front End Engineer",
    "location": "Europe/London",
    "languages": ["English"]
  },
  "newsletter": {
    "title": "Subscribe to {firstName}'s Newsletter",
    "description": "I occasionally write about psychology within development, and share my take on the intersection of psychology and technology.",
    "button": "Subscribe"
  },
  "social": {
    "github": {
      "name": "GitHub",
      "link": "https://github.com/bodthegod"
    },
    "linkedin": {
      "name": "LinkedIn",
      "link": "https://www.linkedin.com/in/joe-playdon-882a58231/"
    },
    "x": {
      "name": "X",
      "link": ""
    },
    "email": {
      "name": "Email",
      "link": "mailto:joeplaydon@gmail.com"
    }
  },
  "home": {
    "label": "Home",
    "title": "{name}'s Portfolio",
    "description": "Portfolio website showcasing my work as a {role}",
    "headline": "Front End Engineer",
    "subline": "I'm Joe, a Front End Engineer at Havona, where I craft intuitive user experiences. After hours, I enjoy researching and building with the latest tech."
  },
  "about": {
    "label": "About",
    "title": "About me",
    "description": "Meet {name}, {role} from {location}",
    "intro": {
      "title": "Introduction",
      "description": "Joe is a Front End Engineer with a lifelong passion for design and detail, specializing in building responsive, user-centric web applications. With expertise in React, TypeScript, and modern frontend frameworks, he bridges the gap between design and functionality to create seamless digital experiences. Currently at Havona, he focuses on developing scalable solutions while staying at the forefront of web technologies. Mentored by senior developers from billion-dollar companies like Wintermute and Ethena, Joe has learned enterprise-level best practices that he combines with creative problem-solving to deliver intuitive interfaces that users love, with love."
    },
    "work": {
      "title": "Work Experience",
      "experiences": {
        "Havona": {
          "timeframe": "Aug 2023 - Present",
          "role": "Front End Engineer",
          "achievements": [
            "Led the complete UI/UX overhaul of Havona's MVP, contributing to the company winning the GTR Asia Tradetech Showcase Award and securing £180k in seed funding.",
            "Successfully integrated Corda 5 blockchain technology with the frontend architecture, enabling secure, real-time transaction processing and distributed ledger functionality across the platform."
          ]
        },
        "Waterman": {
          "timeframe": "Jul 2023 - Sep 2023",
          "role": "Junior Software Developer",
          "achievements": [
            "Developed and implemented a KPI dashboard system using PHP and SQL, providing real-time business metrics visualization and automated daily reports to key stakeholders, improving data-driven decision making.",
            "Engineered an automated PDF report generation system for 12 different engineer roles, successfully digitalizing the business workflow and improving operational efficiency through mobile app integration."
          ]
        }
      }
    },
    "studies": {
      "title": "Studies",
      "institutions": {
        "Code Institute": {
          "description": "Studied Full Stack Software Development."
        },
        "South Staffordshire College": {
          "description": "Studied level 3 Extended Diploma in IT."
        }
      }
    },
    "technical": {
      "title": "Technical skills",
      "skills": {
        "Frontend Development": {
          "description": "Proficient in React, TypeScript, and Next.js, with experience building enterprise-level applications. Skilled in modern state management and performance optimization techniques."
        },
        "UI/UX & Design Systems": {
          "description": "Expert in implementing responsive designs and building component libraries. Experienced with Figma and design system architecture using Ant Design and custom UI frameworks."
        },
        "Blockchain Integration": {
          "description": "Experience integrating Corda 5 and Solana Web3 blockchain technology with frontend applications, implementing secure transaction processing and distributed ledger functionality."
        },
        "Development Tools": {
          "description": "Proficient with Git and modern development workflows. Experienced in agile methodologies and collaborative development using tools like GitHub and JIRA."
        }
      }
    }
  },
  "blog": {
    "label": "Blog",
    "title": "Writing about my journey in tech...",
    "description": "Read what {name} has been up to recently"
  },
  "work": {
    "label": "Work",
    "title": "My projects",
    "description": "Projects by {name}"
  },
  "projectCard": {
    "label": "View Project"
  }
}
